---
kind: method
id: M:Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.Dispose
source: html/960f3fa6-6aaf-7f1e-ba67-82cc60743604.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.Dispose Method

Releases all resources used by the AnalysisDisplayLegendSettings

## Syntax (C#)
```csharp
public void Dispose()
```